Revit 2027 API
BuiltInFailures.SketchFailures.BentFabricSheetEmptySketch Property
 The bend profile requires at least one segment to be placed in a host. Click Continue to correct the profile or Click Quit sketching to exit the bend profile editor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BentFabricSheetEmptySketch { get; }
Public Shared ReadOnly Property BentFabricSheetEmptySketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BentFabricSheetEmptySketch {
	FailureDefinitionId^ get ();
}
static member BentFabricSheetEmptySketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace